# "brew tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# package control
brew "mas"

# dev, python & numerical computing packages
brew "apache-arrow"
brew "cmake"
brew "cython"
brew "gcc"
brew "libomp"
brew "node"
brew "numpy"
brew "nvm"
brew "openblas"
brew "pipx"
brew "python"
brew "rust"
brew "scipy"

# utils
brew "awscli"
brew "bat"
brew "blueutil"
brew "coreutils"
brew "ctop"
brew "diff-so-fancy"
brew "dvc"
brew "exa"
brew "figlet"
brew "fzf"
brew "gdrive"
brew "git"
brew "gopass"
brew "htop"
brew "jo"
brew "jq"
brew "lazydocker"
brew "libgit2"
brew "mpv"
brew "mtr"
brew "neovim"
brew "pinentry-mac"
brew "rsync"
brew "shellcheck"
brew "sleepwatcher"
brew "subversion"
brew "tig"
brew "watch"
brew "wget"

# cask utils
cask "alfred"
cask "appcleaner"
cask "caffeine"
cask "dropbox"
cask "firefox-beta"
cask "gpg-suite"
cask "iterm2-beta"
cask "itsycal"
cask "lastpass"
cask "spotify"

# cask comms
cask "discord"
cask "element"
cask "obs"
cask "signal"
cask "slack"
cask "twobird"
cask "zoom"

# cask dev
cask "docker"
cask "insomnia"
cask "miniforge"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "visual-studio-code-insiders"
cask "visual-studio-code"

# cask fonts
cask "font-fira-code"
cask "font-input"
cask "font-iosevka-nerd-font"
cask "font-iosevka"
cask "font-open-sans"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# mas utils
mas "iA Writer", id: 775737590
mas "Magnet", id: 441258766

# mas apple
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
