# "brew tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# package control
brew "mas"

# python & numerical computing packages
brew "python"
brew "openblas"
brew "cython"
brew "scipy"
brew "numpy"
brew "pipx"

# utils
brew "gopass"
brew "blueutil"
brew "sleepwatcher"
brew "pinentry-mac"
brew "wget"
brew "rsync"
brew "watch"

# dev
brew "git"
brew "htop"
brew "neovim"
brew "node"
brew "nvm"
brew "subversion"
brew "tig"
brew "mtr"

# cask utils
cask "alfred"
cask "dropbox"
cask "firefox-beta"
cask "itsycal"
cask "spotify"
cask "gpg-suite"

# cask comms
cask "signal"
cask "slack"
cask "twobird"
cask "zoom"

# cask dev
cask "docker"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "visual-studio-code"
cask "insomnia"

# cask fonts
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-fira-code"
cask "font-open-sans"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# mas utils
mas "Magnet", id: 441258766
mas "iA Writer", id: 775737590

# mas apple
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
