# "brew tap"
tap "timvw/tap" # qv
tap "jesseduffield/lazygit"

# package control
brew "mas"

# dev, python & numerical computing packages
brew "act"
brew "apache-arrow"
brew "cmake"
brew "cython"
brew "gcc"
brew "go"
brew "libomp"
brew "node"
brew "numpy"
brew "openblas"
brew "pipx"
brew "python"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "rustup"
brew "scipy"
brew "zig"


# utils
brew "atuin"
brew "aws-sam-cli"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "blueutil"
brew "bottom"
brew "btop"
brew "cairo"
brew "colima"
brew "coreutils"
brew "csvlens"
brew "ctop"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-Buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "doggo"
brew "dust"
brew "dsq"
brew "duckdb"
brew "dust"
brew "dvc"
brew "eza"
brew "fd"
brew "figlet"
brew "fzf"
brew "gdrive"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "gitui"
brew "gopass"
brew "htop"
brew "imagemagick"
brew "jesseduffield/lazygit/lazygit"
brew "jo"
brew "jq"
brew "kdash-rs/kdash/kdash"
brew "libgit2"
brew "libpq"
brew "micro"
brew "mpv"
brew "mtr"
brew "multimarkdown"
brew "neovim"
brew "nmap"
brew "numbat"
brew "nvm"
brew "pandoc"
brew "pango"
brew "pinentry-mac"
brew "postgresql@14" # cannot be removed due to python package shittyness
brew "postgresql@17"
brew "procs"
brew "qrencode"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "sleepwatcher"
brew "starship"
brew "subversion"
brew "telnet"
brew "tig"
brew "timvw/tap/qv"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

# cask
cask "ankerwork"
cask "appcleaner"
cask "beeper"
cask "claude"
cask "cursor"
cask "discord"
# cask "docker" # Replaced wby colima
cask "dropbox"
cask "element"
cask "firefox@beta"
cask "google-chrome"
cask "google-chrome@dev"
cask "google-drive"
cask "gpg-suite"
cask "heynote"
cask "httpie-desktop"
cask "insomnia"
cask "iterm2@beta"
cask "itsycal"
cask "jan"
cask "jordanbaird-ice"
cask "kap"
cask "lastpass"
cask "logseq"
cask "mactex"
cask "modern-csv"
cask "orion"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "textbuddy"
cask "the-unarchiver"
cask "visual-studio-code@insiders"
cask "wezterm"
cask "witsy"
cask "zed"
cask "zoom"

# cask fonts
cask "font-commissioner"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-input"
cask "font-iosevka-nerd-font"
cask "font-iosevka"
cask "font-open-sans"
cask "font-outfit"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-source-serif-4"

# mas utils
mas "iA Writer", id: 775737590
mas "Magnet", id: 441258766
mas "LanguageTool", id: 1534275760
mas "Amphetamine", id: 937984704
mas "Agenda", id: 1287445660

# mas apple
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
