# "brew tap"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "timvw/tap"

# package control
brew "mas"

# dev, python & numerical computing packages
brew "act"
brew "apache-arrow"
brew "cmake"
brew "cython"
brew "gcc"
brew "libomp"
brew "node"
brew "numpy"
brew "openblas"
brew "pipx"
brew "python"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "rustup-init"
brew "scipy"
brew "zig"


# utils
brew "atuin"
brew "awscli"
brew "aws-sam-cli"
brew "bandwhich"
brew "bat"
brew "blueutil"
# TODO: unable to replace docker desktop until compose v2 supports the AWS ECS integration
# brew "colima"
brew "cairo"
brew "coreutils"
brew "ctop"
brew "direnv"
brew "dive"
# TODO: Relaplaced by cask until colima can deal with compose
# brew "docker"
brew "dsq"
brew "duckdb"
brew "dust"
brew "dvc"
brew "eza"
brew "fd"
brew "figlet"
brew "fzf"
brew "gdrive"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "gitui"
brew "gopass"
brew "htop"
brew "imagemagick"
brew "jo"
brew "jq"
brew "libgit2"
brew "micro"
brew "mpv"
brew "mtr"
brew "multimarkdown"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pandoc"
brew "pango"
brew "pinentry-mac"
brew "postgresql@14"
brew "postgresql@15"
brew "procs"
brew "qrencode"
brew "qv"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "sleepwatcher"
brew "starship"
brew "subversion"
brew "tig"
brew "tree"
brew "watch"
brew "wget"
brew "yq"

# cask
cask "agenda"
cask "alfred"
cask "appcleaner"
cask "caffeine"
cask "discord"
cask "docker"
cask "dropbox"
cask "element"
cask "firefox-beta"
cask "google-drive"
cask "gpg-suite"
cask "insomnia"
cask "iterm2-beta"
cask "itsycal"
cask "lastpass"
cask "mactex"
cask "modern-csv"
cask "obs"
cask "quarto"
cask "signal"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "textbuddy"
cask "the-unarchiver"
cask "twobird"
cask "visual-studio-code-insiders"
cask "visual-studio-code"
cask "wezterm"
cask "yubico-yubikey-manager"
cask "zoom"

# cask fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-input"
cask "font-iosevka-nerd-font"
cask "font-iosevka"
cask "font-open-sans"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# mas utils
mas "iA Writer", id: 775737590
mas "Magnet", id: 441258766
mas "LanguageTool", id: 1534275760

# mas apple
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
