atom-beautify
autocomplete
autocomplete-modules
busy-signal
feedback
file-icons
git-blame
git-plus
git-time-machine
highlight-selected
Hive
Hydrogen
intentions
language-babel
language-r
language-restructuredtext
language-tmux
linter
linter-eslint
linter-flake8
linter-python-pep8
linter-ui-default
MagicPython
markdown-scroll-sync
markdown-table-formatter
markdown-writer
merge-conflicts
minimap
multi-cursor
pigments
python-autopep8
rst-preview
set-syntax
seti-syntax
seti-ui
sort-lines
split-diff
synced-sidebar
tablr
toggle-quotes
wordcount
