Hive
Hydrogen
atom-beautify
autocomplete
autocomplete-modules
feedback
file-icons
git-plus
git-time-machine
highlight-selected
kite
language-r
language-restructuredtext
linter
linter-python-pep8
markdown-format
markdown-scroll-sync
markdown-table-formatter
markdown-writer
merge-conflicts
minimap
pigments
python-autopep8
rst-preview
set-syntax
seti-syntax
seti-ui
sort-lines
synced-sidebar
tablr
wordcount
